/*
コードは、「変数や関数を用いて、どのような処理をするか」を記述するものです。

そのため、変数や関数への適切な命名は、コード全体のわかりやすさにつながります。

変数や関数の「よい命名」の基準のひとつとして、「コードをそのまま英文にしたときに通じる命名である」というものがあります。

この考え方は、上述した「命名のわかりやすさは、コードのわかりやすさに影響する」という考え方にも通ずるものがあります。

変数や関数の命名の際は、これらのことを意識してみるとよいでしょう。

読みやすいコードを書くためには、変数や関数の命名に対してどのような考え方をすればよいでしょうか。最も適切でないものを、選択肢から 1 つ選んでください。

<選択肢>

1.　一定のルールや慣習のもと、形式の整った命名をするのが望ましい。

2.　変数や関数の名前から意味内容が一意に定まりやすい命名を目指すべきである。

3.　わかりにくい部分はコメントで補えるため、変数名や関数名にあまり気を遣う必要はない。

4.　変数や関数の命名はある意味で「コードの要約」であり、コード全体の可読性に大きく影響する。

*/

3;
